interface Category {
  [category_1:string]: string[]
}

export const CATEGORYS: Category = {
  '여성의류': ['원피스', '스커트/치마', '자켓', '니트/스웨터', '블라우스', '야상/점퍼/패딩',
  '코트', '반팔 티셔츠', '맨투맨/후드티', '가디건', '청바지/스키니(긴)', '면/캐주얼 바지(긴)',
  '셔츠/남방', '트레이닝', '긴팔 티셔츠', '조끼/베스트', '반바지/핫팬츠', '테마/이벤트 의류',
  '언더웨어/속옷', '레깅스', '비즈니스 정장', '빅사이즈'],
  '패션잡화': ['여성가방', '스니커즈', '주얼리/액세서리', '여성화', '지갑', '모자', '벨트/장갑/스타킹/기타',
  '남성화', '시계', '남성가방', '안경/선글라스', '여행용가방/소품'],
  '남성의류': ['점퍼/야상패딩', '맨투맨/후드티', '반팔 티셔츠', '자켓', '셔츠/남방', '트레이닝',
  '청바지(긴)', '니트/스웨터', '면/캐주얼 바지(긴)', '코트', '긴팔 티셔츠', '반바지/7~9부', '가디건',
  '조끼/베스트', '비즈니스 정장', '언더웨어/속옷', '테마/이벤트 의류', '빅사이즈'],
  '디지털/가전': ['모바일', '가전제품', '음반/영상/관련기기', 'PC/모니터/주변기기', '게임/타이틀',
  '노트북/넷북', '카메라/DSLR'],
  '도서/티켓/취미/애완': ['도서/책', '취미/키덜트', '희귀/수집품', '기프티콘/쿠폰', '반려동물용품',
  '예술/악기/수공예품', '상품권', '티켓/항공권'],
  '스타굿즈': ['보이그룹', '걸그룹', '솔로(남)', '솔로(여)', '기타(방송인)', '배우(남)', '배우(여)'],
  '생활/문구/가구/식품': ['생활용품', '주방용품', '가구', '식품'],
  '스포츠/레저': ['골프', '축구', '등산/클라이밍', '자전거', '헬스/요가/필라테스', '수상 스포츠', 
  '캠핑', '야구', '기타 구기 스포츠', '낚시', '겨울 스포츠', '농구', '볼링', '전동킥보드/전동휠', 
  '인라인/스케이트보드', '배드민턴', '탁구', '테니스', '당구'],
  '뷰티/미용': ['색조메이크업', '스킨케어', '향수/아로마', '이미용품/미용 기기', '헤어/바디', 
  '베이스메이크업', '네일아트/케어', '다이어트/이색 뷰티', '썬케어', '남성 화장품'],
  '유아동/출산': ['여아의류(3-6세)', '유아동신발/잡화', '교육/완구/인형', '남아의류(3-6세)', 
  '베이비의류(0-2세)', '유아동용품', '여주니어의류(7세~)', '남주니어의류(7세~)', '기저귀/수유/이유식', '출산/임부용품'],
  '차량/오토바이': ['타이어/휠', '차량 부품', '오토바이/스쿠터', '차량/튜닝 용품', '국산차', '산업용품', 
  '네비게이션/블랙박스', '수입차', '카오디오/영상'],
  '기타': [],
}