interface Category {
  [category:string]: string[]
}

interface IdxToCategory {
  [idx:string]: string
}

export const CATEGORYS: Category = {
  '여성의류-100': ['원피스-10001', '스커트·치마-10002', '자켓-10003', '니트·스웨터-10004', '블라우스-10005', '야상·점퍼·패딩-10006',
    '코트-10007', '반팔 티셔츠-10008', '맨투맨·후드티-10009', '가디건-10010', '청바지·스키니(긴)-10011', '면·캐주얼 바지(긴)-10012',
    '셔츠·남방-10013', '트레이닝-10014', '긴팔 티셔츠-10015', '조끼·베스트-10016', '반바지·핫팬츠-10017', '테마·이벤트 의류-10018',
    '언더웨어·속옷-10019', '레깅스-10020', '비즈니스 정장-10021', '빅사이즈-10022'],
  '패션잡화-200': ['여성가방-20001', '스니커즈-20002', '주얼리·액세서리-20003', '여성화-20004', '지갑-20005', '모자-20006', '벨트·장갑·스타킹·기타-20007',
    '남성화-20008', '시계-20009', '남성가방-20010', '안경·선글라스-20011', '여행용가방·소품-20012'],
  '남성의류-300': ['점퍼·야상패딩-30001', '맨투맨·후드티-30002', '반팔 티셔츠-30003', '자켓-30004', '셔츠·남방-30005', '트레이닝-30006',
    '청바지(긴)-30007', '니트·스웨터-30008', '면·캐주얼 바지(긴)-30009', '코트-30010', '긴팔 티셔츠-30011', '반바지·7~9부-30012', '가디건-30013',
    '조끼·베스트-30014', '비즈니스 정장-30015', '언더웨어·속옷-30016', '테마·이벤트 의류-30017', '빅사이즈-30018'],
  '디지털·가전-400': ['모바일-40001', '가전제품-40002', '음반·영상·관련기기-40003', 'PC·모니터·주변기기-40004', '게임·타이틀-40005',
    '노트북·넷북-40006', '카메라·DSLR-40007'],
  '도서·티켓·취미·애완-500': ['도서·책-50001', '취미·키덜트-50002', '희귀·수집품-50003', '기프티콘·쿠폰-50004', '반려동물용품-50005',
    '예술·악기·수공예품-50006', '상품권-50007', '티켓·항공권-50008'],
  '스타굿즈-600': ['보이그룹-60001', '걸그룹-60002', '솔로(남)-60003', '솔로(여)-60004', '기타(방송인)-60005', '배우(남)-60006', '배우(여)-60007'],
  '생활·문구·가구·식품-700': ['생활용품-70001', '주방용품-70002', '가구-70003', '식품-70004'],
  '스포츠·레저-800': ['골프-80001', '축구-80002', '등산·클라이밍-80003', '자전거-80004', '헬스·요가·필라테스-80005', '수상 스포츠-80006', 
    '캠핑-80007', '야구-80008', '기타 구기 스포츠-80009', '낚시-80010', '겨울 스포츠-80011', '농구-80012', '볼링-80013', '전동킥보드·전동휠-80014', 
    '인라인·스케이트보드-80015', '배드민턴-80016', '탁구-80017', '테니스-80018', '당구-80019'],
  '뷰티·미용-900': ['색조메이크업-90001', '스킨케어-90002', '향수·아로마-90003', '이미용품·미용 기기-90004', '헤어·바디-90005', 
    '베이스메이크업-90006', '네일아트·케어-90007', '다이어트·이색 뷰티-90008', '썬케어-90009', '남성 화장품-90010'],
  '유아동·출산-1000': ['여아의류(3~6세)-100001', '유아동신발·잡화-100002', '교육·완구·인형-100003', '남아의류(3~6세)-100004', 
    '베이비의류(0~2세)-100005', '유아동용품-100006', '여주니어의류(7세~)-100007', '남주니어의류(7세~)-100008', '기저귀·수유·이유식-100009', '출산·임부용품-100010'],
  '차량·오토바이-1100': ['타이어·휠-110001', '차량 부품-110002', '오토바이·스쿠터-110003', '차량·튜닝 용품-110004', '국산차-110005', '산업용품-110006', 
    '네비게이션·블랙박스-110007', '수입차-110008', '카오디오·영상-110009'],
  '기타-1200': [],
}

export const IDXTOCATEGORY: IdxToCategory = {
  '100': '여성의류-100',
  '200': '패션잡화-200',
  '300': '남성의류-300',
  '400': '디지털·가전-400',
  '500': '도서·티켓·취미·애완-500',
  '600': '스타굿즈-600',
  '700': '생활·문구·가구·식품-700',
  '800': '스포츠·레저-800',
  '900': '뷰티·미용-900',
  '1000': '유아동·출산-1000',
  '1100': '차량·오토바이-1100',
}